using System.Collections;
using System.Collections.Generic;
using UnityEngine;
using UnityEngine.UI;

public class info : MonoBehaviour
{
    /// <summary>
    /// モンスターのステータスはHP・素早さ・攻撃
    /// </summary>
    /// 
    public string[,] a = {
        {"アッチャ" ,"250","12","15"},//連撃・奥義・捕獲
        {"黒" ,"3000","20","50",},//専用・回復・強化
        {"白" ,"1200","30","35",},//専用・回復・強化
        {"雷雲","300","35","10" },
        {"風雲" ,"300","35","10"},//デバフ1.2・強攻撃
        {"岩ゴーレム" ,"400","5","12"},//強化・回復・すてみ
        {"青岩ゴーレム" ,"700","1","1"},
        {"獣" ,"0","50","1"},
    };
    public int[,] MonsSkill = {
        {0,2,4,3},//相棒：連撃・奥義・捕獲
        {10,10,10,10},//黒：専用・
        {0,9,6,5},//白：専用・回復・強化
        {0,1,2,3},//かみなりくも：
        {0,0,0,0},//かぜくも：デバフ1.2・強攻撃
        {0,5,6,8},//ゴーレム：強化・回復・すてみ
        {0,5,6,8},//マナゴーレム：
        {0,0,0,0},//もふもふ：
    };


    //技名・技区分・補正・その他効果・消費MP

    public string[,] skill = {
        {"通常攻撃" ,               "0","30","1","0"},//0ーーーーーーーーーーーー
        {"エレメントアタック", "0","80","1","20"},
        {"連撃",                      "0","0","4","10"},
        {"森羅万象" ,               "0","75","2","40"},
        {"捕獲強化" ,               "1","0","10","10"},
        {"大地の鼓舞" ,            "1","1","10","10"},//攻撃＋５　　//5ーーーーーーーーー
        {"自己再生" ,               "1","2","10","10"},//150回復
        {"発勁" ,                     "2","2","2","20"},
        {"すてみタックル" ,      "3","150","50","20"},//自分に50ダメージ
        {"穿つ極光" ,               "3","150","20","10"},//撃つたびに攻撃力が下がる
        {"終末の刻" ,               "3","50","200","5"},//10ーーーーーーーーーーー

    };
    public void Attack1(int HP, int MP, int At, Text text, string name, int buffd, int buffT, int buff)
    {
        text.text = (name + "の攻撃：" + skill[0, 0] + "\n");

        MP -= int.Parse(skill[0, 4]);

        int d = At + int.Parse(skill[0, 2]);
        if (buffT > 0 && buff == 1)
        {
            d += buffd;
            buffT--;
        }
        text.text += (d + "ダメージ　");
        HP -= d;
    }

}
