using System.Collections;
using System.Collections.Generic;
using UnityEngine;
using UnityEngine.UI;

public class info : MonoBehaviour
{
    /// <summary>
    /// モンスターのステータスはHP・素早さ・攻撃
    /// </summary>
    /// 
    public string[,] a = {
        {"アッチャ" ,"250","32","15"},//連撃・奥義・捕獲
        {"黒" ,"3000","20","25",},//専用・回復・強化
        {"白" ,"1000","30","80",},//専用・回復・強化
        {"雷雲","300","35","10" },
        {"風雲" ,"300","35","10"},//デバフ1.2・強攻撃
        {"岩ゴーレム" ,"400","5","12"},//強化・回復・すてみ
        {"青岩ゴーレム" ,"700","1","1"},
        {"獣" ,"200","50","30"},
    };
    public int[,] MonsSkill = {
        {0,2,5,3},//相棒：連撃・奥義・捕獲
        {17,10,2,12},//黒：専用
        {17,9,0,16},//白：専用・回復・強化
        {0,1,2,0},//かみなりくも：
        {0,13,14,15},//かぜくも：デバフ1.2・強攻撃
        {0,5,6,8},//ゴーレム：強化・回復・すてみ
        {0,5,6,8},//マナゴーレム：
        {0,2,2,2},//獣：
    };


    //技名・技区分・補正・その他効果・消費MP

    public string[,] skill = {
        {"通常攻撃" ,               "0","30","1","0"},//0ーーーーーーーーーーーー
        {"マナボール",             "0","80","1","10"},
        {"連撃",                      "0","0","4","5"},
        {"森羅万象" ,               "0","75","2","30"},
        {"捕獲強化" ,               "1","0","10","10"},
        {"大地の鼓舞" ,            "1","1","10","5"},//攻撃＋５　　//5ーーーーーーーーー
        {"自己再生" ,               "1","2","150","20"},//150回復
        {"発勁" ,                     "2","2","2","20"},
        {"ロッククラッシュ" ,    "3","140","40","10"},//自分に40ダメージ
        {"穿つ極光" ,               "3","150","20","10"},//撃つたびに攻撃力が下がる
        {"終末の刻" ,               "3","50","100","15"},//10ーーーーーーーーーーー
        {"治癒の光" ,            "1","2","200","5"},//200回復
        {"破滅の秒針" ,  　  "3","150","50","0"},//自分に50ダメージ
        {"ソフトクラウド" ,    "2","20","50","25"},//攻撃デバフ
        {"スロウクラウド" ,    "2","20","50","20"},//速さデバフ
        {"破裂" ,    "3","150","300","0"},//自爆//15ーーーーーーーーーーー
        {"白の鼓舞" ,         "1","10","10","0"},//白専用強化
        {"龍撃" ,               "0","80","1","0"},//
    };

    public string[] setumei = {
        "通常攻撃" ,
        "マナボール",
        "連撃",
        "森羅万象" ,
        "捕獲率を上げる。" ,
        "味方全体の\n攻撃力が上がる。" ,
        "体力が150回復する。" ,
        "発勁" ,               
        "反動40を受けて\n技威力140の攻撃",
        "使う度攻撃が下がる\n技威力140の攻撃" ,//撃つたびに攻撃力が下がる
        "反動を受け攻撃上昇\n技威力50の攻撃",//10ーーーーーーーーーーー
        "体力が200回復する。",//200回復
        "反動50を受けて\n技威力150の攻撃",//自分に50ダメージ
        "相手の\n攻撃力が下がる。" ,//攻撃デバフ
        "相手の\n速さが下がる。" ,//速さデバフ
        "自爆して\n技威力150の攻撃" ,//自爆//15ーーーーーーーーーーー
        "味方全体の\n攻撃力が上がる。" ,//白専用強化
        "龍撃" 
    };
    public void Attack1(int HP, int MP, int At, Text text, string name, int buffd, int buffT, int buff)
    {
        text.text = (name + "の攻撃：" + skill[0, 0] + "\n");

        MP -= int.Parse(skill[0, 4]);

        int d = At + int.Parse(skill[0, 2]);
        if (buffT > 0 && buff == 1)
        {
            d += buffd;
            buffT--;
        }
        text.text += (d + "ダメージ　");
        HP -= d;
    }

}
